#include "avltree.h"
#include "node.h"
#include <fstream>
#include <iostream>
#include <string>
using namespace std;


void avltree::inorder(node *kombos) //Ενδοδιατεταγμένη προσπέλαση του δένδρου avl
{
    if(kombos==NULL)
    {
        return;
    }
    else
    {
        inorder(kombos->getlc());
        cout<<kombos->getvalue()<<"  ";
        inorder(kombos->getrc());
        return;
    }
}


void avltree::preorder(node *kombos) //Προδιατεταγμένη προσπέλαση του δένδρου avl
{
    if(kombos==NULL)
    {
        return;
    }
    else
    {
        cout<<kombos->getvalue()<<endl;
        preorder(kombos->getlc());
        preorder(kombos->getrc());
        return;
    }
}


void avltree::left(node *kombos) //Συνάρτηση που υλοποιεί την αριστερή περιστροφή
{
    node* tempnode;
    tempnode=kombos->getrc();
    kombos->setrc(tempnode->getlc());
    if(tempnode->getlc()!=NULL)
    {
        tempnode->getlc()->setpr(kombos);
    }
    tempnode->setlc(kombos);

    if(kombos->getvalue()!=root->getvalue()) //Αν ο κόμβος δεν είναι η ρίζα, δηλαδή αν ο κόμβος έχει γονέα
    {
        if(kombos->getpr()->getrc()!=NULL) //Αν ο γονέας του κόμβου έχει δεξί παιδί
        {
            if(kombos->getpr()->getrc()->getvalue()==kombos->getvalue()) //Αν ο κόμβος είναι δεξί παιδί του γονέα του
            {
                kombos->getpr()->setrc(tempnode); //Κάνε δεξί παιδί του γονέα του κόμβου το δεξί παιδί του κόμβου
                tempnode->setpr(kombos->getpr());  
            }
            else
            {
                kombos->getpr()->setlc(tempnode); //Κάνε αριστερό παιδί του γονέα του κόμβου το δεξί παιδί του κόμβου
                tempnode->setpr(kombos->getpr());  
            }
        }
        else
        {
            kombos->getpr()->setlc(tempnode); //Κάνε αριστερό παιδί του γονέα του κόμβου το δεξί παιδί του κόμβου
            tempnode->setpr(kombos->getpr());  
        }
    }
    else //Αλλιώς, δηλαδή αν ο κόμβος είναι ρίζα, κάνε ρίζα το δεξί παιδί του κόμβου
    {
        root=tempnode;
        tempnode->setpr(NULL);
    } 
    kombos->setpr(tempnode);
}


void avltree::right(node *kombos) //Συνάρτηση που υλοποιεί την δεξιά περιστροφή
{
    node* tempnode;
    tempnode=kombos->getlc();
    kombos->setlc(tempnode->getrc());
    if(tempnode->getrc()!=NULL)
    {
        tempnode->getrc()->setpr(kombos);
    }
    tempnode->setrc(kombos);

    if(kombos->getvalue()!=root->getvalue()) //Αν ο κόμβος δεν είναι η ρίζα, δηλαδή αν ο κόμβος έχει γονέα
    {
        if(kombos->getpr()->getrc()!=NULL)
        {
            if(kombos->getpr()->getrc()->getvalue()==kombos->getvalue()) //Αν ο κόμβος είναι δεξί παιδί του γονέα του
            {
                kombos->getpr()->setrc(tempnode); //Κάνε δεξί παιδί του γονέα του κόμβου το αριστερό παιδί του κόμβου
                tempnode->setpr(kombos->getpr());
            }    
        }
        if(kombos->getpr()->getlc()!=NULL)
        {
            if(kombos->getpr()->getlc()->getvalue()==kombos->getvalue()) //Αν ο κόμβος είναι αριστερό παιδί του γονέα του
            {
                kombos->getpr()->setlc(tempnode); //Κάνε αριστερό παιδί του γονέα του κόμβου το αριστερό παιδί του κόμβου
                tempnode->setpr(kombos->getpr());
            }    
        }
    }
    else //Αλλιώς, δηλαδή αν ο κόμβος είναι ρίζα, κάνε ρίζα το αριστερό παιδί του κόμβου
    {
        root=tempnode;
        tempnode->setpr(NULL);
    }   
    kombos->setpr(tempnode);
}


int avltree::foo(node *kombos, int height) //Συνάρτηση με την οποία βρίσκω το υψος του υποδένδρου με ρίζα τον κόμβο kombos.
{
    int h1,h2; //Στο h1 αποθηκεύουμε το ύψος του αριστερού υποδένδρου του kombos. Στο h2 αποθηκεύουμε το ύψος του δεξιού υποδένδρου του kombos
    if (kombos == NULL) //Αν ο κόμβος είναι NULL τότε επιστρέφω το ύψος που έχω υπολογίσει
    {
        return height;
    }
    else
    {
        h1=foo(kombos->getlc(),height+1); //Υπολογίζω με αναδρομική κλήση της foo το ύψος του αριστερού υποδένδρου του kombos.
        h2=foo(kombos->getrc(),height+1); //Υπολογίζω με αναδρομική κλήση της foo το ύψος του δεξιού υποδένδρου του kombos.
        
        //Με την παρακάτω if επιστρέφω το μεγαλύτερο από τα ύψη των υποδένδρων του κόμβου.
        if(h1>h2) 
        {
            return h1;
        }
        else
        {
            return h2;
        }
    }
}


void avltree::peristrofes(node *kombos) //H μεταβλητή balanced γίνεται true αν με την προηγούμενη κλήση της συνάρτησης peristrofes το δένδρο έγινε δένδρο AVL
{

    int t1,t2; //Στη μεταβλητή t1 αποθηκεύω το ύψος του δεξιού υποδένδρου του κόμβου. Στη μεταβλητή t2 αποθηκεύω το ύψος του αριστερού υποδένδρου του κόμβου.
    bool balanced=false;

    while(kombos!=NULL && balanced!=true) //Όσο ο κόμβος kombos δεν είναι κενός και με την προηγούμενη κλήση της συνάρτησης peristrofes το δένδρο δεν έγινε δένδρο AVL εξετάζουμε αν χρειάζεται κάποια περιστροφή το δένδρο με ρίζα τον κόμβο kombos
    {
        t1=foo(kombos->getrc(),0); //Εκχωρώ στο t1 το ύψος του δεξιού υποδένδρου του κόμβου με κλήση της συνάρτησης foo με παράμετρο το δεξί παιδί του κόμβου και το 0
        t2=foo(kombos->getlc(),0); //Εκχωρώ στο t2 το ύψος του δεξιού υποδένδρου του κόμβου με κλήση της συνάρτησης foo με παράμετρο το δεξί παιδί του κόμβου και το 0
        
        if(t1>t2) //Αν το ύψος του δεξιού υποδένδρου του κόμβου είναι μεγαλύτερο από το ύψος του αριστερού υποδένδρου του κόμβου
        {
            if(t1-t2>=2) //Αν χρειάζεται να γίνει κάποια περιστροφή
            {
                balanced=true; //Μετά την περιστροφή το δένδρο θα είναι AVL
                //Αν το δεξί υποδένδρο του δεξιού παιδιού του κόμβου έχει μεγαλύτερο ύψος από το αριστερό υποδένδρο του δεξιού παιδιού του κόμβου τότε αρκεί να γίνει μια απλή αριστερή περιστροφή
                if(foo(kombos->getrc()->getrc(),0)>foo(kombos->getrc()->getlc(),0))
                {
                    left(kombos);
                }
                else //Αλλιώς χρειάζεται να κάνουμε μία διπλή περιστροφή right left
                {
                    right(kombos->getrc());
                    left(kombos);
                }
            }
        }
        else if(t1<t2)//Αν το ύψος του δεξιού υποδένδρου του κόμβου είναι μικρότερο
        {
            if(t2-t1>=2) //Αν χρειάζεται να γίνει κάποια περιστροφή
            {
                balanced=true; //Μετά την περιστροφή το δένδρο θα είναι AVL
                //Αν το αριστερό υποδένδρο του αριστερού παιδιού του κόμβου έχει μεγαλύτερο ύψος από το δεξί υποδένδρο του αριστερού παιδιού του κόμβου τότε αρκεί να γίνει μια απλή δεξιά περιστροφή
                if(foo(kombos->getlc()->getlc(),0)>foo(kombos->getlc()->getrc(),0))
                {
                    right(kombos);
                }
                else //Αλλιώς χρειάζεται να κάνουμε μία διπλή περιστροφή left right
                {
                    left(kombos->getlc());
                    right(kombos);
                }
            }
        }
        kombos=kombos->getpr(); //Επαναλαμβάνουμε τη διαδικασία για τον γονέα του κόμβου τον οποίο μόλις εξετάσαμε
    }
    return;
}


void avltree::build(const char *filename) //Υλοποιούμε μία συνάρτηση με παράμετρο το όνομα του αρχείου από το οποίο δέχεται τα δεδομένα
{
    ifstream g;
    int timh;
    g.open(filename);//Ανοίγουμε το αρχείο filename από το οποίο θα διαβάσουμε τα δεδομένα
    
    if (g.is_open ()) //Ελέγχουμε αν το αρχείο άνοιξε επιτυχώς
    {
        size=0;
        root=NULL;
         
        while(g>>timh)
        {
            insert(timh); //Εισάγουμε την τιμή που διαβάσαμε από το αρχείο στο δένδρο
        }
        g.close(); //Κλείνουμε το αρχείο


    }
    else
    {
        cerr<<"Couldn't open file."; //Αν το αρχείο δεν μπορεί να ανοίξει επιτυχώς εμφανίζουμε ένα μήνυμα σφάλαμτος στην οθόνη
    }
}


avltree::avltree() //Υλοποιούμε τον default constructor της avltree
{
    size=0;
    root=NULL;
}


int avltree::getsize() //Δημιουργούμε μία συνάρτηση getsize η οποία επιστρέφει το size γιατί το size είναι private μεταβλητή
{
    return size;
}


void avltree::insert(int number) //Δημιουργούμε μία συνάρτηση insert η οποία εισάγει ένα στοιχείο στο δένδρο avl ετσι ώστε αυτό να παραμείνει δένρο avl
{
    node *inserted; //Ο δείκτης inserted είναι δείκτης που δείχνει στον κόμβο που εισάγεται
    node *parent; //Βοηθητική μεταβλητή την οποία χρησιμοποιούμε για να βρούμε τον γονέα του κόμβου που προστίθεται στο δένδρο avl 
    int position; //Βοηθητική μεταβλητή την οποία χρησιμοποιούμε για να βρούμε ποιο παιδί του γονέα (αριστερό ή δεξί) θα είναι ο κόμβος που εισάγεται
    
    size++;

    
    //1ο μέρος: Προσθέτουμε τον κόμβο στο δένδρο έτσι ωστε αυτό να συνεχίσει να είναι δυαδικό δένδρο αναζήτησης
    
    parent=NULL;
    
    position=0; //Όταν το postion είναι 0 αυτό σημαίνει ότι δεν έχουμε βρει ακόμα τον γονέα του κόμβου που εισάγεται

    inserted=new node(number);

    if(root==NULL) //Αν το στοιχείο που προσθέτουμε είναι το πρώτο στοιχείο που προστίθεται στο δένδρο
	{
        root=new node;
	    root=inserted; //Βάλε τον δείκτη root να δείχνει στον κόμβο που εισάγεται
        inserted->setpr(NULL);
        return;
	}
    else //αλλιώς, δηλαδή αν το δένδρο δεν είναι άδειο
	{   
        parent=root; //Θέσε ως parent την ρίζα του δένδρου 
        do
        {
            if(number<parent->getvalue()) //Αν η τιμή του στοιχείου που θέλουμε να εισάγουμε στο δένδρο είναι μικρότερη από την τιμή του parent τότε  
        	{
        	    if(parent->getlc()!=NULL) //Αν ο γονέας έχει αριστερό παιδί
        	    {
        	        parent=parent->getlc(); //Βάλε τον parent να δείχνει στο αριστερό παιδί του τρέχοντος parent 
        	    }
        	    else //αλλιώς, κάνε αριστερό παιδί του τον κόμβο που εισάγεται
        	    {
        	        position=1; //Όταν το position είναι ίσο με το 1 αυτό σημαίνει ότι έχουμε βρει τον γονέα του κόμβου που εισάγεται και ο κόμβος που εισάγεται γίνεται αριστερό του παιδί
        	    }
        	}
            else //αλλιώς
        	{
                if(parent->getrc()!=NULL) //Αν ο γονέας έχει δεξί παιδί
        	    {
        	        parent=parent->getrc(); //Βάλε τον parent να δείχνει στο δεξί παιδί του τρέχοντος parent 
        	    }
        	    else //αλλιώς, κάνε δεξί παιδί του τον κόμβο που εισάγεται
        	    {
        	        position=2; //Όταν το position είναι ίσο με το 2 αυτό σημαίνει ότι έχουμε βρει τον γονέα του κόμβου που εισάγεται και ο κόμβος που εισάγεται γίνεται δεξί του παιδί
        	    }      	
        	}
        }
        while(position==0); //Όσο δεν έχουμε βρει τον γονέα του κόμβου που εισάγεται

        
        //Κάνουμε τον κόμβο που εισάγεται παιδί του γονέα που βρήκαμε.
        //Με την παρακάτω if ελέγχουμε αν ο κόμβος γίνεται αριστερό η δεξί παιδί
        if (position==1)
        {
            parent->setlc(inserted); //Ο κόμβος που εισάγεται γίνεται αριστερό παιδί του γονέα που βρήκαμε
        }
        else
        {            
            parent->setrc(inserted); //Ο κόμβος που εισάγεται γίνεται αριστερό παιδί του γονέα που βρήκαμε 
        }        
        
	}

    inserted->setpr(parent); //Κάνω τον γονέα που βρήκαμε γονέα του κόμβου

    //2ο μέρος: Κάνουμε τις απαραίτητες περιστροφές έτσι ώστε το δένδρο να είναι AVL


    peristrofes(inserted);

}


int avltree::findmin() //Συνάρτηση η οποία βρίσκει και επιστρέφει το ελάχιστο στοιχείο του δένδρου avl
{
    //Το δένδρο avl είναι δυαδικό δένδρο αναζήτησης άρα για να βρούμε το μικρότερο στοιχείο του αρκεί να πάρουμε το πιο αριστερό στοιχείο στο δένδρο. Δηλαδή αρχίζουμε από την ρίζα και ελέγχουμε αν έχει αριστερό παιδί. Αν ναι, παίρνουμε το αριστερό παιδί της και επαναλαμβάνουμε την διαδικασία. Αν όχι, τότε η τιμή του τελευταίου κόμβου που ελέγξαμε είναι η ελάχιστη τιμή του δένδρου.

    //Αρχικά εξετάζουμε την ρίζα
    
    int min; //Στη μεταβλητή min αποθηκεύουμε την μικρότερη τιμή που έχουμε βρει κατά την διαδικασία της αναζήτησης της μικρότερης τιμής
    min=root->getvalue(); //Αρχικά η min παίρνει την τιμή της ρίζας
    node *kombos; //Ο κόμβος kombos είναι ο κόμβος τον οποίον εξετάζουμε
    kombos=root; //Αρχικά ο κόμβος kombos είναι η ρίζα
    
    while(kombos->getlc()!=NULL) //Όσο ο κόμβος τον οποίον εξετάζουμε έχει αριστερό παιδί 
    {
        min=kombos->getlc()->getvalue(); //Θέσε στο min την τιμή του αριστερού παιδιού
        kombos=kombos->getlc(); //Εξέτασε το αριστερό παιδί του κόμβου που εξετάζεις
    }
    return min;
}


string avltree::search(int n) //Η συνάρτηση search αναζητάει το στοιχείο με τιμή n στο δένδρο AVL και αν το βρει επιστρέφει το string "SUCCESS" αλλιώς επιστρέφει το string "FAILURE"
{
    node *kombos;
    kombos=root; //Αρχίζουμε την εξέτση των κόμβων του δένδρου από την ρίζα
    while(kombos->getvalue()!=n) //Όσο ο δεν έχει βρεθεί κόμβος με τιμή n στο δένδρο
    {
        if(kombos->getvalue()>n) //Αν η τιμή του κόμβου που εξετάζουμε είναι μεγαλύτερη από το n 
        {
            if(kombos->getlc()!=NULL) //Αν ο κόμβος έχει αριστερό παιδί
            {
                kombos=kombos->getlc(); //Εξετάζουμε το αριστερό παιδί
            }
            else 
            {
                return "FAILURE"; //Ο κόμβος με τιμή n δεν υπάρχει στον γράφο
            }
        }
        else //Αν η τιμή του κόμβου που εξετάζουμε είναι μικρότερη από το n 
        {
            if(kombos->getrc()!=NULL) //Αν ο κόμβος έχει δεξί παιδί
            {
                kombos=kombos->getrc(); //Εξετάζουμε το δεξί παιδί
            }
            else
            {
                return "FAILURE"; //Ο κόμβος με τιμή n δεν υπάρχει στον γράφο
            }
        }
    }
    return "SUCCESS"; //Ο κόμβος με τιμή n υπάρχει στον γράφο αφού δεν έχει γίνει επιστροφή
}


void avltree::delete_node(int number) //Δημιουργούμε μία συνάρτηση delete_node η οποία διαγράφει ένα στοιχείο από το δένδρο avl ετσι ώστε αυτό να παραμείνει δένρο avl
{
    //Εκτελούμε την διαδικασία της αναζήτησης όπως γίνεται και στη συνάρτηση search. Δεν επιστρέφουμε το string "SUCCESS" όταν βρούμε τον κόμβο που έχει τιμή number. Αντ' αυτού διαγράφουμε τον κόμβο από το δένδρο AVL. Επίσης, αντί να επιστρέφει το string "FAILURE" δεν επιστρέφει τίποτα
    node *kombos;
    kombos=root;
    while(kombos->getvalue()!=number)
    {
        if(kombos->getvalue()>number)
        {
            if(kombos->getlc()!=NULL)
            {
                kombos=kombos->getlc();
            }
            else
            {
                return;
            }
        }
        else
        {
            if(kombos->getrc()!=NULL)
            {
                kombos=kombos->getrc();
            }
            else
            {
                return;
            }
        }
    }

    
    //Εφόσον δεν έχει γίνει return, στο δένδρο υπάρχει κόμβος με τιμή number άρα διαγράφουμε τον κόμβο από το δένδρο
    
    //1ο βήμα: Διαγράφουμε τον κόμβο από το δένδρο έτσι ώστε αυτό να παραμείνει δένδρο δυαδικής αναζήτησης
    //2ο βήμα: Κάνουμε τις απαραίτητες περιστροφές έτσι ώστε το δένδρο να είναι δένδρο AVL

    bool riza,deji; //Η μεταβλητή riza είναι true αν ο κόμβος με τιμή number είναι η ρίζα και η μεταβλητή deji είναι true αν ο κόμβος με τιμή number είναι το δεξί παιδί του γονέα του (αν αυτός υπάρχει)
    node *kombos2;
    int count;

    
    riza=false;
    if(kombos->getvalue()==root->getvalue()) //Αν ο κόμβος με τιμή number είναι η ρίζα κάνε το riza true
    {
        riza=true;
    }
    else if(kombos->getpr()->getrc()!=NULL) //Αν ο γονέας του κόμβου έχει δεξί παιδί 
    {
        if(kombos->getpr()->getrc()->getvalue()==kombos->getvalue()) //Αν ο κόμβος είναι δεξί παιδί του γονέα του κάνε το deji true
        {
            deji=true;
        }  
        else //Αλλιώς, δηλαδή αν ο κόμβος είναι αριστερό παιδί του γονέα του κάνε το deji false
        {
            deji=false;
        }
    }
    else //Αλλιώς, δηλαδή αν ο γονέας του κόμβου δεν έχει δεξί παιδί τότε ο κόμβος είναι αριστερό παιδί του γονέα του άρα κάνε το deji false
    {
        deji=false;
    }

    

    
    if(kombos->getlc()==NULL && kombos->getrc()==NULL) //Αν ο κόμβος με τιμή number είναι φύλλο
    {
        if(riza==true) //Αν ο κόμβος με τιμή number είναι και ρίζα
        {
            root=NULL;
        }
        else if(deji==true) //Αλλιώς αν ο κόμβος είναι δεξί παιδί του γονέα του
        {
            kombos->getpr()->setrc(NULL); //Κάνε δεξί παιδί του γονέα το NULL
            peristrofes(kombos->getpr()); //Έλεγξε αν το δένδρο χρειάζεται περιστροφή και αν ναι εκτέλεσε την απαραίτητη περιστροφή
        }  
        else //Αλλιώς, δηλαδή αν ο κόμβος είναι αριστερό παιδί του γονέα του
        {
            kombos->getpr()->setlc(NULL); //Κάνε αριστερό παιδί του γονέα το NULL
            peristrofes(kombos->getpr()); //Έλεγξε αν το δένδρο χρειάζεται περιστροφή και αν ναι εκτέλεσε την απαραίτητη περιστροφή
        }

    }
    else if(kombos->getlc()==NULL) //Αλλιώς, αν ο κόμβος έχει δεξί υποδένδρο αλλά όχι αριστερό
    {
        if(riza==true) //Αν ο κόμβος είναι ρίζα τότε
        {
            root=kombos->getrc(); //Κάνε ρίζα το δεξί παιδί του κόμβου
            root->setpr(NULL); //Κάνε γονέα της ρίζας το NULL
        }
        else if(deji==true) //Αλλιώς αν ο κόμβος είναι δεξί παιδί του γονέα του
        {
            //Το δεξί παιδί του κόμβου γίνεται δεξί παιδί του γονέα του κόμβου
            kombos->getpr()->setrc(kombos->getrc()); 
            kombos->getrc()->setpr(kombos->getpr()); 
        }
        else //Αλλιώς, δηλαδή αν ο κόμβος είναι αριστερό παιδί του γονέα του
        {
            //Το δεξί παιδί του κόμβου γίνεται αριστερό παιδί του γονέα του κόμβου
            kombos->getpr()->setlc(kombos->getrc());
            kombos->getrc()->setpr(kombos->getpr());
        }

        peristrofes(kombos->getrc()); //Έλεγξε αν το δένδρο χρειάζεται περιστροφή και αν ναι εκτέλεσε την απαραίτητη περιστροφή
    }
    else if(kombos->getrc()==NULL) //Αλλιώς, αν ο κόμβος έχει αριστερό υποδένδρο αλλά όχι δεξί
    {
        if(riza==true) //Αν ο κόμβος είναι ρίζα τότε
        {
            root=kombos->getlc(); //Κάνε ρίζα το αριστερό παιδί του κόμβου
            root->setpr(NULL); //Κάνε γονέα της ρίζας το NULL
        }
        else if(deji==true) //Αλλιώς αν ο κόμβος είναι δεξί παιδί του γονέα του
        {
            //Το αριστερό παιδί του κόμβου γίνεται δεξί παιδί του γονέα του κόμβου
            kombos->getpr()->setrc(kombos->getlc());
            kombos->getlc()->setpr(kombos->getpr());
        }
        else //Αλλιώς, δηλαδή αν ο κόμβος είναι αριστερό παιδί του γονέα του
        {
            //Το αριστερό παιδί του κόμβου γίνεται αριστερό παιδί του γονέα του κόμβου
            kombos->getpr()->setlc(kombos->getlc());
            kombos->getlc()->setpr(kombos->getpr());
        }

        peristrofes(kombos->getlc()); //Έλεγξε αν το δένδρο χρειάζεται περιστροφή και αν ναι εκτέλεσε την απαραίτητη περιστροφή
    }
    else //Αλλιώς, δηλαδή αν ο κόμβος έχει αριστερό και δεξί υποδένδρο
    {
        //Αντικαθιστώ τον κόμβο με το μικρότερο στοιχείο του δεξιού υποδένδρου

        //Βρίσκω τον κόμβο με την μικρότερη τιμή στο δεξί υποδένδρο του κόμβου kombos και τον δείχνω με τον δείκτη kombos2

        count=0;
        kombos2=kombos->getrc(); 
        while(kombos2->getlc()!=NULL)
        {
            kombos2=kombos2->getlc();
            count++;
        }
        
        kombos->setvalue(kombos2->getvalue()); //Εκχωρώ στην τιμή του κόμβου που θέλω να διαγράψω την τιμή του μικρότερου στοιχείου του δεξιού του υποδένδρου

        if(count!=0) //Αν το δεξί του υποδένδρο αποτελείται από παρπάνω ένα στοιχεία
        {
            //Ο δείκτης στο αριστερό παιδί του γονέα του kombos2 αυτού γίνεται NULL
            kombos2->getpr()->setlc(NULL);
        }
        else //Αλλιώς
        {
            //Το δεξί του υποδένδρο αποτελείται μόνο από ένα στοιχείο άρα ο γονέας του kombos2 είναι ο kombos άρα ο δείκτης στο δεξί του παιδί γίνεται NULL και όχι στο αριστερό.
            kombos2->getpr()->setrc(NULL);
        }

        peristrofes(kombos2->getpr()); //Έλεγξε αν το δένδρο χρειάζεται περιστροφή και αν ναι εκτέλεσε την απαραίτητη περιστροφή
        
    }


    size--; //Μετά την διαγραφή του κόμβου το μέγεθος του δένδρου μειώνεται κατά 1

}