#ifndef GRAPH_H
#define GRAPH_H

#include "vertice.h"
#include "minheap_gr.h"

class graph
{
private:
	vertice *koryfes; //Στον δυναμικό πίνακα koryfes αποθηκεύω τις κορυφές του γράφου
	int order; //Η μεταβλητή order είναι η τάξη, δηλαδή το πλήθος των κορυφών του γράφου
	int size; //Η μεταβλητή size είναι το μέγεθος, δηλαδή το πλήθος των ακμών του γράφου
	 
public:
	graph(); //Κατασκευαστής του graph που αρχικοποιεί την τάξη και το μέγεθος του γράφου με 0

	void build(const char* filename4);//Μια συνάρτηση που δέχεται ως παράμετρο το όνομα του αρχείου από το οποίο διαβάζει τα δεδομένα για την κατασκευή του γράφου και κατασκευάζει τον γράφο

	int computeshortestpath(int n1,int n2); //Συνάρτηση η οποία υπολογίζει τη συντομότερη διαδρομή από την κορυφή με τιμή n1 στην κορυφή με τιμή n2

	int Dijkstra(int t1,int t2); //Συνάρτηση που εφαρμόζει τον αλγόριθμο του Dijkstra


	void insert(int n1,int n2,int w); //Συνάρτηση με την οποία εισάγουμε στον γράφο τις κορυφές με τιμή n1 και n2 αν αυτές δεν υπάρχουν ήδη. Επίσης, με την insert εισάγουμε στον γράφο την ακμή με τερματικά σημεία τις κορυφές με τιμές n1 και n2 και βάρος w αν αυτή δεν υπάρχει ήδη
	
	void delete_graph_edge(int n1,int n2); //Συνάρτηση με την οποία διαγράφουμε από τον γράφο την ακμή με τερματικά σημεία τις κορυφές με τιμές n1 και n2 αν αυτή υπάρχει.

	long int cc2(); //Η συνάρτηση cc2 βοηθάει στην εκτέλεση του Prim για κάθε συνιστώσα του γράφου
	long int Prim(char color2[],int n); //Συνάρτηση που υλοποιεί τον αλγόριθμο του Prim 
	int fcc(); //Η συνάρτηση fcc υπολογίζει και επιστρέφει το πλήθος των συνιστωσών του γράφου
	void DFSVisit(char color[],int u); //Η συνάρτηση DFSVisit προσπελάυνει τα στοιχεία της συνιστώσας που περιέχει την κορυφή που βρίσκεται στην θέση u στον πίνακα koryfes
	void DFSVisit2(char color2[],int u,char color3[]); //Η συνάρτηση DFSVisit2 προσπελάυνει τα στοιχεία της συνιστώσας που περιέχει την κορυφή που βρίσκεται στην θέση u στον πίνακα koryfes


	//getters
	int getsize();
	int getorder();
	vertice getkoryfes(int i);

};

#endif