#include "hashtable.h"
#include <fstream>
#include <iostream>
using namespace std;

hashtable::hashtable() //Κατασκευαστής της hashtable που αρχικοποιεί το maxsize με 50 και κάνει το data πίνακα με 50 θέσεις
{
    data=new int[50];
    maxsize=50;
}


void hashtable::build(const char* filename) //Μία συνάρτηση που δέχεται ως παράμετρο το όνομα του αρχείου από το οποίο θα διαβάζει τα δεδομένα για την κατασκευή του πίνακα κατακερματισμού
{
	ifstream l;
	int n1;
    int i;

    //Αρχικοποιούμε το μέγεθος του πίνακα σε 50 και αρχικοποιούμε τις τιμές του πίνακα σε -1
    maxsize=50;
    data=new int[50];
    for(i=0;i<50;i++)
    {
        data[i]=-1;
    }
	
    l.open(filename);//Ανοίγουμε το αρχείο filename από το οποίο θα διαβάσουμε τα δεδομένα
    if(l.is_open()) //Ελέγχουμε αν το αρχείο άνοιξε επιτυχώς
    {
        
		while(l>>n1) //Όσο υπάρχουν τιμές στο αρχείο αποθηκεύεται η τιμή της γραμμής του αρχείου στη μεταβλητή n1
        {
			insert(n1);//Εισάγουμε στον πίνακα κατακερματισμού την τιμή n1 αν αυτή δεν υπάρχει ήδη.
        }
        l.close(); //Κλείνουμε το αρχείο

    }
    else
    {
        cerr<<"Couldn't open file."; //Αν το αρχείο δεν μπορεί να ανοίξει επιτυχώς εμφανίζουμε ένα μήνυμα σφάλαμτος στην οθόνη
    }
}


void hashtable::insert(int n) //Με την συνάρητση insert εισάγουμε στον πίνακα κατακερματισμού το στοιχείο με τιμή n
{
    int newmaxsize;
    int *data2;
    int i;
    int th; //Η θέση του n στον πίνακα data
    th=(3*n+7)%maxsize; //Έστω οτι η συνάρτηση h(n)=(3*n+7)%maxsize είναι η συνάρτηση κατακερματισμού μας

    if(getsize()==maxsize) //Αν ο πίνακας έχει γεμίσει τότε
    {
        newmaxsize=2*maxsize;
        
        //Αντιγράφω τα στοιχεία του data στον data2
        data2=new int[maxsize];
        for(i=0;i<maxsize;i++)
        {
            data2[i]=data[i];
        }

        //Διαγράφω τον data και δεσμεύω τον διπλάσιο χώρο από όσο είχα δεσμευμένο πριν
        delete[] data;
        data=new int[newmaxsize];

        //Διπλασιάζω το μέγεθος
        maxsize=2*maxsize;

        for(i=0;i<maxsize;i++)
        {
            data[i]=-1;
        }
        //Ξανατοποθετώ τα στοιχεία στον πίνακα κατακερματσιμού και η συνάρτηση κατακερματισμού αλλάζει γιατί έχει αλλάξει το maxsize
        for(i=0;i<maxsize/2;i++)
        {
            if(data2[i]!=-1)
            {
                th=(3*data2[i]+7)%maxsize;
                if(data[th]==-1) //Αν δεν έχει τοποθετηθεί αριθμός στην θέση th του πίνακα data
                {
                    data[th]=data2[i]; //Τοποθέτησε σε αυτήν το data2[i]
                }
                else
                {
                    //Σε περίπτωση που έχει ήδη τοποθετηθεί κάποιος αριθμός στην θέση th του πίνακα data γίνεται αναζήτηση για την επόμενη θέση στην οποία δεν έχει τοποθετηθεί κάποιος αριθμός.
                    while(data[th]!=-1)
                    {
                        th++;
                        if(th==maxsize) //Αν φτάσουμε στο τέλος του πίνακα τότε πηγαίνουμε στην αρχή του
                        {
                            th=0;
                        }
                    }
                    data[th]=data2[i];
                }
            }
        }
        th=(3*n+7)%maxsize;
    }
    
    if(data[th]==-1) //Αν δεν έχει τοποθετηθεί αριθμός στην θέση th του πίνακα data
    {
        data[th]=n; //Τοποθέτησε σε αυτήν το n
    }
    else
    {
        //Σε περίπτωση που έχει ήδη τοποθετηθεί κάποιος αριθμός στην θέση th του πίνακα data γίνεται αναζήτηση για την επόμενη θέση στην οποία δεν έχει τοποθετηθεί κάποιος αριθμός.
        while(data[th]!=-1)
        {
            th++;
            if(th==maxsize) //Αν φτάσουμε στο τέλος του πίνακα τότε συνεχίζουμε από την αρχή του
            {
                th=0;
            }
        }
        data[th]=n;
    }

}


int hashtable::getsize() //Η συνάρτηση getsize υπολογίζει και επιστρέφει το πλήθος των στοιχείων του πίνακα κατακερματισμού
{
    int pl_st;
    int i;

    pl_st=0;
    //Για κάθε στοιχείο του πίνακα data
    for(i=0;i<maxsize;i++)
    {
        if(data[i]!=-1) //Αν το στοιχείο είναι διάφορο του -1 τότε
        {
            pl_st++; //Αυξάνεται το πλήθος των στοιχείων του πίνακα κατακερματισμού
        }
    }

    return pl_st; //Επιστρέφεται το πλήθος των στοιχείων του πίνακα κατακερματισμού
}


string hashtable::search(int n) //Η συνάρτηση search αναζητάει το στοιχείο με τιμή n στον πίνακα κατακερματισμού και αν το βρει επιστρέφει το string "SUCCESS" αλλιώς επιστρέφει το string "FAILURE"
{
    int i;
    int thn; //Στην thn αποθηκεύω την θέση του n στον πίνακα data
    thn=(3*n+7)%maxsize;

    if(n==-1) //Μας δίνεται οτι ο πίνακας κατακερματισμού αποτελείται μόνο από θετικά στοιχεία.΄Ομως περιέχει και το -1 το οποίο υποδηλώνει ότι η θέση είναι κενή. Άρα αν γίνει αναζήτηση του -1 πρέπει να επιστραφεί το "FAILURE".
    {
        return "FAILURE";
    }
    if(data[thn]==-1) //Αν η θέση στην οποία θα έπρεπε να είναι το n εχει το -1 (δηλαδή είναι κενή) 
    {
        return "FAILURE";
    }
    if(data[thn]==n) //Αν η θέση στην οποία θα έπρεπε να είναι το n δεν είναι κενή και δεν έχει γίνει σύγκρουση 
    {
        return "SUCCESS";
    }
    else //Αν η θέση στην οποία θα έπρεπε να είναι το n δεν είναι κενή και έχει γίνει σύγκρουση 
    {
        i=thn+1;
        while(i!=thn) //Όσο δεν έχεις ελέγξει όλα τα στοιχεία
        {
            if(data[i]==n)
            {
                return "SUCCESS";
            }
            if(data[i]==-1)
            {
                return "FAILURE";
            }
            i++;
            if(i==maxsize) //Αν ο έλεγχος φτάσει στο τέλος του πίνακα τότε συνέχισε τον έλεγχο από την αρχή του πίνακα
            {
                i=0;
            }
        }
        //Αν έχεις ελέγξει όλα τα στοιχεία και δεν έχεις βρει το n τότε επίστρεψε "FAILURE"
        return "FAILURE";
    }
}