#include <iostream>
#include <fstream>
#include <cstring>
#include <ctime>
using namespace std;

#include "minheap.h"
#include "maxheap.h"
#include "avltree.h"
#include "graph.h"
#include "hashtable.h"

int main()
{
    ifstream f; //Δηλώνουμε ένα ρεύμα εισόδου
    ofstream f2; //Δηλώνουμε ένα ρεύμα εξόδου
    
    
    char* com; //Ο δείκτης com θα δείχνει σε έναν πίνακα χαρακτήρων στον οποίον θα αποθηκεύεται κάθε φορά η εντολή του αρχείου commands.txt την οποία θα εκτελούμε
    string line; //Στο string line θα αποθηκεύεται κάθε φορά η εντολή του αρχείου commands.txt την οποία θα εκτελούμε
    
    
    int j,k,l,m;
    
    
    char *filename; //Δημιουργούμε έναν δείκτη σε χαρακτήρα με όνομα filename ο οποίος θα δείχνει στον πίνακα που θα περιέχει το όνομα του αρχείου από το οποίο θα διβαάζει τα στοιχεία ο κατασκευαστής του σωρού ελαχίστων
    char *filename2; //Δημιουργούμε έναν δείκτη σε χαρακτήρα με όνομα filename2 ο οποίος θα δείχνει στον πίνακα που θα περιέχει το όνομα του αρχείου από το οποίο θα διβαάζει τα στοιχεία ο κατασκευαστής του σωρού μεγίστων
    char *filename3; //Δημιουργούμε έναν δείκτη σε χαρακτήρα με όνομα filename3 ο οποίος θα δείχνει στον πίνακα που θα περιέχει το όνομα του αρχείου από το οποίο θα διβαάζει τα στοιχεία ο κατασκευαστής του δένδρου avl
    char *filename4; //Δημιουργούμε έναν δείκτη σε χαρακτήρα με όνομα filename4 ο οποίος θα δείχνει στον πίνακα που θα περιέχει το όνομα του αρχείου από το οποίο θα διβαάζει τα στοιχεία ο κατασκευαστής του γράφου
    char *filename5; //Δημιουργούμε έναν δείκτη σε χαρακτήρα με όνομα filename5 ο οποίος θα δείχνει στον πίνακα που θα περιέχει το όνομα του αρχείου από το οποίο θα διβαάζει τα στοιχεία ο κατασκευαστής του πίνακα κατακερματισμού

    
    minheap minheap; //Δημιουργούμε ένα αντικείμενο της κλάσης minheap με όνομα minheap_object. Αυτό θα είναι ο σωρός ελαχίστων μας.
    maxheap maxheap; //Δημιουργούμε ένα αντικείμενο της κλάσης maxheap με όνομα maxheap_object. Αυτό θα είναι ο σωρός μεγίστων μας.
    avltree avl; //Δημιουργούμε ένα αντικείμενο της κλάσης avltree με όνομα avl. Αυτό θα είναι το δένδρο AVL μας.
    graph graph; //Δημιουργούμε ένα αντικείμενο της κλάσης graph με όνομα gr. Αυτό θα είναι ο γράφος μας.
    hashtable hashtable; //Δημιουργούμε ένα αντικείμενο της κλάσης hashtable με όνομα hash. Αυτό θα είναι ο πίνακας κατακερματισμού μας.
    
    
    clock_t start; //Στην μεταβλητή start θα αποθηκεύσουμε τον χρόνο πριν την εκτέλεση ορισμένων εντολών τις οποίες χρειάζεται να χρονομετρήσουμε
    clock_t end; //Στην μεταβλητή end θα αποθηκεύσουμε τον χρόνο πριν την εκτέλεση ορισμένων εντολών τις οποίες χρειάζεται να χρονομετρήσουμε
    float duration; //Στη μεταβλητή duration θα αποθηκεύσουμε τον χρόνο εκτέλεσης ορισμένων εντολών
    
    
    
    f.open("commands.txt"); //Ανοίγουμε το αρχείο commands.txt
    f2.open("output.txt"); //Ανοίγουμε το αρχείο  output.txt
    
    
    
    if (f.is_open() && f2.is_open())//Ελέγχουμε αν τα αρχεία άνοιξαν επιτυχώς
    {
        while(getline(f,line)) //Όσο το αρχείο commands.txt έχει γραμμές που δεν έχουν διαβαστεί αποθήκευσε την επόμενη γραμμή του στο string line
        {
            com=new char[line.size()]; //Δέσμευσε για τον πίνακα χαρακτήρων com τόσες θέσεις όσες το μήκος του string line στο οποίο είναι αποθηκευμμένη η εντολή που πρέπει να εκτελστεί
            strcpy(com,line.c_str()); //Αντίγραψε στον πίνακα com τους χαρακτήρες του line
            

            
            //Εντολές που αφορούν τον σωρό ελαχίστων:
            
            
            
            if(strstr(com,"BUILD MINHEAP")!=NULL) //Αν στη γραμμή i του πίνακα χαρκτήρων υπάρχει η εντολή "BUILD MINHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                
                start=clock();
                
                filename=new char[strlen(com)-14]; //Δεσμεύουμε τόσες θέσεις όσες χρειάζόμαστε για να αποθηκεύσουμε το μήκος του ονόματος του αρχείου που θα χρειαστεί να ανοίξουμε, δηλαδή όσο το μήκος της εντολής του αρχείου commands.txt μείον το μήκος του "BUILD MINHEAP"
                for(j=14;j<strlen(com);j++)
                {
                    filename[j-14]=com[j];
                }
                //Με την παραπάνω for αποθηκεύουμε στον πίνακα χαρακτήρων filename το όνομα του αρχείου που θα χρειαστεί να ανοίξουμε
                minheap.build(filename); //Εκτελούμε την συνάρτηση build με παράμετρο το όνομα του αρχείου filename για το αντικείμενο minheap_object
                                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της BUILD MINHEAP: "<<duration<<endl;
            }
            else if(strstr(com,"GETSIZE MINHEAP")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "GETSIZE  MINHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το μέγεθος του σωρού ελαχίστων είναι: "<<minheap.getsize()<<endl; //Εγγράφουμε στο αρχείο output.txt το μέγεθος του σωρού ελαχίστων, το οποίο παίρνουμε με τη συνάρτηση getsize και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της GETSIZE MINHEAP: "<<duration<<endl;
            }
            else if(strstr(com,"FINDMIN MINHEAP")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "FINDMIN MINHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το ελάχιστο στοιχείο από το σωρό ελαχίστων είναι το: "<<minheap.findmin()<<endl; //Εγγράφουμε το ελάχιστο στοιχείο του σωρού στο output.txt και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της FINDMIN MINHEAP: "<<duration<<endl;
            }
            else if(strstr(com,"INSERT MINHEAP")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "INSERT MINHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να εισάγουμε στον σωρό
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT MINHEAP " στο com και δημιουργούμε τον αριθμό που ακολουθεί 
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                number=(int)com[15]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT MINHEAP " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=16;com[k]>='0'&&com[k]<='9';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                
                
                minheap.insert(number); //Καλούμε την insert για το αντικείμενο minheap
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της INSERT MINHEAP "<<number<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"DELETEMIN MINHEAP")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "DELETEMIN  MINHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                minheap.deletemin(); //Κάλεσε την συνάρτηση deletemin για το αντικείμενο minheap_object η οποία διαγράφει το ελάχιστο στοιχείο του σωρού
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της DELETEMIN MINHEAP: "<<duration<<endl;
            }
           
            
            
            //Εντολές που αφορούν τον σωρό μεγίστων:
            
            
            
            else if(strstr(com,"BUILD MAXHEAP")!=NULL) //Αν στη γραμμή i του πίνακα χαρκτήρων υπάρχει η εντολή "BUILD MAXHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                
                start=clock();
                                
                filename2=new char[strlen(com)-13]; //Δεσμεύουμε τόσες θέσεις όσες χρειάζόμαστε για να αποθηκεύσουμε το μήκος του ονόματος του αρχείου που θα χρειαστεί να ανοίξουμε, δηλαδή όσο το μήκος της εντολής του αρχείου commands.txt μείον το μήκος του "BUILD MAXHEAP"
                for(j=14;j<strlen(com);j++)
                {
                    filename2[j-14]=com[j];
                }
                filename2[j-14]='\0';
                //Με την παραπάνω for αποθηκεύουμε στον πίνακα χαρακτήρων filename2 το όνομα του αρχείου που θα χρειαστεί να ανοίξουμε
                maxheap.build(filename2); //Εκτελούμε την συνάρτηση build με παράμετρο το όνομα του αρχείου filename2 για το αντικείμενο maxheap_object
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της BUILD MAXHEAP: "<<duration<<endl;
            }
            else if(strstr(com,"GETSIZE MAXHEAP")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "GETSIZE  MAXHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το μέγεθος του σωρού μεγίστων είναι: "<<maxheap.getsize()<<endl; //Εγγράφουμε στο αρχείο output.txt το μέγεθος του σωρού μεγίστων, το οποίο παίρνουμε με τη συνάρτηση getsize και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της GETSIZE MAXHEAP: "<<duration<<endl;
            }
            else if(strstr(com,"FINDMAX MAXHEAP")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "FINDMAX MAXHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το μέγιστο στοιχείο από το σωρό μεγίστων είναι το: "<<maxheap.findmax()<<endl; //Εγγράφουμε το μέγιστο στοιχείο του σωρού στο output.txt και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της FINDMAX MAXHEAP: "<<duration<<endl;
            }
            else if(strstr(com,"INSERT MAXHEAP")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "INSERT MAXHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να εισάγουμε στον σωρό
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT MAXHEAP " στο com και δημιουργούμε τον αριθμό που ακολουθεί 
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                number=(int)com[15]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT MAXHEAP " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=16;com[k]>='0'&&com[k]<='9';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                                
                maxheap.insert(number); //Καλούμε την insert για το αντικείμενο maxheap_object
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της INSERT MAXHEAP "<<number<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"DELETEMAX MAXHEAP")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "DELETEMAX  MAXHEAP" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                maxheap.deletemax(); //Κάλεσε την συνάρτηση deletemax για το αντικείμενο maxheap_object η οποία διαγράφει το μέγιστο στοιχείο του σωρού
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της DELETEMAX MAXHEAP: "<<duration<<endl;
            }
            
            
            
            //Εντολές που αφορούν το δένδρο AVL:


            
            else if(strstr(com,"BUILD AVLTREE")!=NULL) //Αν στη γραμμή i του πίνακα χαρκτήρων υπάρχει η εντολή "BUILD AVLTREE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                
                start=clock();
                
                
                filename3=new char[strlen(com)-13]; //Δεσμεύουμε τόσες θέσεις όσες χρειάζόμαστε για να αποθηκεύσουμε το μήκος του ονόματος του αρχείου που θα χρειαστεί να ανοίξουμε, δηλαδή όσο το μήκος της εντολής του αρχείου commands.txt μείον το μήκος του "BUILD AVLTREE" 
                for(j=14;j<strlen(com);j++)
                {
                    filename3[j-14]=com[j];
                }
                filename3[j-14]='\0';
                //Με την παραπάνω for αποθηκεύουμε στον πίνακα χαρακτήρων filename3 το όνομα του αρχείου που θα χρειαστεί να ανοίξουμε

                
                avl.build(filename3); //Εκτελούμε την συνάρτηση build με παράμετρο το όνομα του αρχείου filename3 για το αντικείμενο avl
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της BUILD AVLTREE: "<<duration<<endl;
                
            }
            else if(strstr(com,"GETSIZE AVLTREE")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "GETSIZE  AVLTREE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το μέγεθος του δένδρου AVL είναι: "<<avl.getsize()<<endl; //Εγγράφουμε στο αρχείο output.txt το μέγεθος του δένδρου AVL, το οποίο παίρνουμε με τη συνάρτηση getsize και στη συνέχεια αλλάζουμε γραμμή
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της GETSIZE AVLTREE: "<<duration<<endl;
            }
            else if(strstr(com,"FINDMIN AVLTREE")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "FINDMIN AVLTREE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το ελάχιστο στοιχείο από το δένδρο AVL είναι το: "<<avl.findmin()<<endl; //Εγγράφουμε το ελάχιστο στοιχείο του δένδρου AVL στο output.txt και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της FINDMIN AVLTREE: "<<duration<<endl;
            }
            else if(strstr(com,"SEARCH AVLTREE")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "SEARCH AVLTREE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να προσθέσουμε στο δένδρο AVL
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "SEARCH AVLTREE " στο com και δημιουργούμε τον αριθμό που ακολουθεί 


                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                number=(int)com[15]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "SEARCH AVLTREE " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=16;com[k]>='0' && com[k]<='9' && com[k]!='\n';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }


                f2<<"Βρέθηκε το στοιχείο με τιμή "<<number<<" στο δένδρο AVL? "<<avl.search(number)<<endl; //Εγγράφουμε στο αρχείο output.txt αν βρέθηκε το στοιχείο με τιμή την τιμή που δίνεται στο αρχείο commands.txt
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της SEARCH AVLTREE "<<number<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"INSERT AVLTREE")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "INSERT AVLTREE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να εισάγουμε στο δένδρο AVL
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT AVLTREE " στο com και δημιουργούμε τον αριθμό που ακολουθεί 
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                    
                number=(int)com[15]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT AVLTREE " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=16;com[k]>='0'&&com[k]<='9';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                
                
                avl.insert(number); //Καλούμε την insert για το αντικείμενο avl με παράμετρο τη μεταβλητή number
                
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της INSERT AVLTREE "<<number<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"DELETE AVLTREE")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "DELETE AVLTREE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να διαγράψουμε από το δένδρο AVL
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "DELETE AVLTREE " στο com και δημιουργούμε τον αριθμό που ακολουθεί 
    
                //O αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις

                number=(int)com[15]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "DELETE AVLTREE " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=16;com[k]>='0'&&com[k]<='9';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                
                avl.delete_node(number); //Καλούμε την delete_node για το αντικείμενο avl με παράμετρο τη μεταβλητή number
                
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της DELETE AVLTREE "<<number<<": "<<duration<<endl;
                
            }
            


            
            //Εντολές που αφορούν το γράφημα χωρίς κατευθύνσεις και χωρίς βάρη στις ακμές:


            
            else if(strstr(com,"BUILD GRAPH")!=NULL) //Αν στη γραμμή i του πίνακα χαρκτήρων υπάρχει η εντολή "BUILD GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                
                start=clock();
                
                
                filename4=new char[strlen(com)-11]; //Δεσμεύουμε τόσες θέσεις όσες χρειάζόμαστε για να αποθηκεύσουμε το μήκος του ονόματος του αρχείου που θα χρειαστεί να ανοίξουμε, δηλαδή όσο το μήκος της εντολής του αρχείου commands.txt μείον το μήκος του "BUILD GRAPH"
                for(j=12;j<strlen(com);j++)
                {
                    filename4[j-12]=com[j];
                }
                filename4[j-12]='\0';
                //Με την παραπάνω for αποθηκεύουμε στον πίνακα χαρακτήρων graph το όνομα του αρχείου που θα χρειαστεί να ανοίξουμε
                
                graph.build(filename4); //Εκτελούμε την συνάρτηση build με παράμετρο το όνομα του αρχείου filename4 για το αντικείμενο gr
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της BUILD GRAPH: "<<duration<<endl;
                
            }
            else if(strstr(com,"GETSIZE GRAPH")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "GETSIZE  GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το μέγεθος του γράφου είναι: "<<graph.getsize()<<endl; //Εγγράφουμε στο αρχείο output.txt το μέγεθος του γράφου, το οποίο παίρνουμε με τη συνάρτηση getsize και στη συνέχεια αλλάζουμε γραμμή
                f2<<"Η τάξη του γράφου είναι: "<<graph.getorder()<<endl; //Εγγράφουμε στο αρχείο output.txt την τάξη του γράφου, το οποίο παίρνουμε με τη συνάρτηση getorder και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της GETSIZE GRAPH: "<<duration<<endl;
            }
            else if(strstr(com,"INSERT GRAPH")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "INSERT GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                int n1,n2,w; //Δημιουργούμε 3 ακέραιες μεταβλητές n1,n2,w στις οποίες θα αποθηκεύσουμε τις τιμές των κορυφών και τα βάρη της ακμής που θέλουμε να εισάγουμε στον γράφο

                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT GRAPH" στο com και δημιουργούμε τον αριθμό n1
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                    
                n1=(int)com[13]-48; //Στη μεταβλητή n1 αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT GRAPH " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=14;com[k]>='0'&&com[k]<='9';k++)
                {
                    n1=(n1*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }

                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT GRAPH n1" στο com και δημιουργούμε τον αριθμό n2
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                n2=(int)com[k+1]-48; //Στη μεταβλητή n2 αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT GRAPH n1" αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(l=k+2;com[l]>='0'&&com[l]<='9';l++)
                {
                    n2=(n2*10)+((int)com[l]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }

                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT GRAPH n1 n2" στο com και δημιουργούμε τον αριθμό w
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                w=(int)com[l+1]-48; //Στη μεταβλητή w αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT GRAPH n1 n2" αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(m=l+2;com[m]>='0'&&com[m]<='9';m++)
                {
                    w=(w*10)+((int)com[m]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                
                graph.insert(n1,n2,w); //Καλούμε την insert για το αντικείμενο gr με παραμέτρους τα n1,n2,w
                
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της INSERT GRAPH "<<n1<<" "<<n2<<" "<<w<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"DELETE GRAPH")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "DELETE GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                int n1,n2; //Δημιουργούμε 2 ακέραιες μεταβλητές n1,n2 στις οποίες θα αποθηκεύσουμε τις τιμές των κορυφών της ακμής που θέλουμε να διαγράψουμε από τον γράφο

                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "DELETE GRAPH" στο com και δημιουργούμε τον αριθμό n1
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                n1=(int)com[13]-48; //Στη μεταβλητή n1 αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "DELETE GRAPH " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=14;com[k]>='0'&&com[k]<='9';k++)
                {
                    n1=(n1*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "DELETE GRAPH n1" στο com και δημιουργούμε τον αριθμό n2
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                n2=(int)com[k+1]-48; //Στη μεταβλητή n2 αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "DELETE GRAPH n1" αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(l=k+2;com[l]>='0'&&com[l]<='9';l++)
                {
                    n2=(n2*10)+((int)com[l]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }
                
                graph.delete_graph_edge(n1,n2); //Καλούμε την delete_graph_edge για το αντικείμενο gr με παραμέτρους τα n1 και n2
                
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της DELETE GRAPH "<<n1<<" "<<n2<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"COMPUTESHORTESTPATH GRAPH")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "COMPUTESHORTESTPATH GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
              
                int n1,n2; //Δημιουργούμε 2 ακέραιες μεταβλητές n1,n2 στις οποίες θα αποθηκεύσουμε τις τιμές των κορυφών για τις οποίες θέλουμε να υπολογίσουμε το κόστος της ελάχιστης διαδρομής από την κορυφή με τιμή n1 στην κορυφή με τιμή n2

                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "COMPUTESHORTESTPATH GRAPH" στο com και δημιουργούμε τον αριθμό n1
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                n1=(int)com[26]-48; //Στη μεταβλητή n1 αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "COMPUTESHORTESTPATH GRAPH " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=27;com[k]>='0'&&com[k]<='9';k++)
                {
                    n1=(n1*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }

                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "COMPUTESHORTESTPATH GRAPH n1" στο com και δημιουργούμε τον αριθμό n2
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                n2=(int)com[k+1]-48; //Στη μεταβλητή n2 αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "COMPUTESHORTESTPATH GRAPH n1" αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(l=k+2;com[l]>='0'&&com[l]<='9';l++)
                {
                    n2=(n2*10)+((int)com[l]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }

             
                f2<<"Το κόστος της ελάχιστης διαδρομής από τον κόμβο "<<n1<<" στον κόμβο "<<n2<<" είναι: "<<graph.Dijkstra(n1,n2)<<endl;


                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της COMPUTESHORTESTPATH GRAPH "<<n1<<" "<<n2<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"FINDCONNECTEDCOMPONENTS GRAPH")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "FINDCONNECTEDCOMPONENTS GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το πλήθος των συνεκτικών συνιστώσεων του γράφου είναι: "<<graph.fcc()<<endl; //Εγγράφουμε στο αρχείο output.txt το πλήθος των συνεκτικών συνιστώσεων του γράφου, το οποίο παίρνουμε με τη συνάρτηση findconnectedcomponents και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της FINDCONNECTEDCOMPONENTS GRAPH: "<<duration<<endl;
            }
            else if(strstr(com,"COMPUTESPANNINGTREE GRAPH")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "COMPUTESPANNINGTREE GRAPH" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το κόστος του ελάχιστου εκτεινόμενου δένδρου του γράφου είναι: "<<graph.cc2()<<endl; //Εγγράφουμε στο αρχείο output.txt το κόστος του ελάχιστου εκτεινόμενου δένδρου του γράφου, το οποίο παίρνουμε με τη συνάρτηση computespanningtree και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της COMPUTESPANNINGTREE GRAPH: "<<duration<<endl;
            }


            
            //Εντολές που αφορούν το πίνακα κατακερματισμού



            else if(strstr(com,"BUILD HASHTABLE")!=NULL) //Αν στη γραμμή i του πίνακα χαρκτήρων υπάρχει η εντολή "BUILD HASHTABLE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                
                start=clock();
                
                
                filename5=new char[strlen(com)-15]; //Δεσμεύουμε τόσες θέσεις όσες χρειάζόμαστε για να αποθηκεύσουμε το μήκος του ονόματος του αρχείου που θα χρειαστεί να ανοίξουμε, δηλαδή όσο το μήκος της εντολής του αρχείου commands.txt μείον το μήκος του "BUILD HASHTABLE"
                for(j=16;j<strlen(com);j++)
                {
                    filename5[j-16]=com[j];
                }
                filename5[j-16]='\0';
                //Με την παραπάνω for αποθηκεύουμε στον πίνακα χαρακτήρων hashtable το όνομα του αρχείου που θα χρειαστεί να ανοίξουμε
                hashtable.build(filename5); //Εκτελούμε την συνάρτηση build με παράμετρο το όνομα του αρχείου filename5 για το αντικείμενο ht
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της BUILD HASHTABLE: "<<duration<<endl;
                
            }
            else if(strstr(com,"INSERT HASHTABLE")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "INSERT HASHTABLE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να εισάγουμε στον πίνακα κατακερματισμού
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "INSERT HASHTABLE " στο com και δημιουργούμε τον αριθμό που ακολουθεί 
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                number=(int)com[17]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "INSERT HASHTABLE " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=18;com[k]>='0' && com[k]<='9' && com[k]!='\n';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }


                hashtable.insert(number); //Εισάγουμε στον πίνακα κατακερματσιμού ht το στοιχείο με τιμή number
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της INSERT HASHTABLE "<<number<<": "<<duration<<endl;
                
            }
            else if(strstr(com,"GETSIZE HASHTABLE")!=NULL) //Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "GETSIZE  HASHTABLE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                
                f2<<"Το πλήθος των στοιχείων του πίνακα κατακερματισμού είναι: "<<hashtable.getsize()<<endl; //Εγγράφουμε στο αρχείο output.txt το πλήθος των στοιχείων του πίνακα κατακερματισμού, το οποίο παίρνουμε με τη συνάρτηση getsize, και στη συνέχεια αλλάζουμε γραμμή
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της GETSIZE HASHTABLE: "<<duration<<endl;
            }
            else if(strstr(com,"SEARCH HASHTABLE")!=NULL)//Αν στη γραμμή i του πίνακα com υπάρχει η εντολή "SEARCH HASHTABLE" τότε εκτέλεσε τις παρακάτω εντολές
            {
                start=clock();
                int number; //Δημιουργούμε μία ακέραια μεταβλητή number στην οποία θα αποθηκεύσουμε το στοιχείο που θέλουμε να προσθέσουμε στον πίνακα κατακερματισμού
                
                //Με την παρακάτω for εξετάζουμε κάθε χαρακτήρα που ακολουθεί το "SEARCH HASHTABLE " στο com και δημιουργούμε τον αριθμό που ακολουθεί 
                
                //Ο αριθμός είναι μη αρνητικός, άρα εκτέλεσε τις παρακάτω εντολές για να τον βρεις
                
                number=(int)com[17]-48; //Στη μεταβλητή number αποθηκεύουμε τον πρώτο χαρακτήρα που ακολουθεί το "SEARCH HASHTABLE " αφού πρώτα τον μετατρέψουμε σε ASCII με το (int) και στη συνέχεια τον μετατρέπουμε σε ακέραια μορφή του αρχικού χαρακτήρα αφαιρώντας 48
                for(k=18;com[k]>='0' && com[k]<='9' && com[k]!='\n';k++)
                {
                    number=(number*10)+((int)com[k]-48); //Κάθε φορά που συναντάμε και άλλον χαρακτήρα που είναι νούμερο μετακινούμε όλους τους υπόλοιπους αριθμούς μία θέση προς τα αριστερά (πολλαπλασιάζοντας με το 10) και τοποθετούμε τον νέο αριθμό που συναντάμε στο τέλος (προσθέτοντας τον αφού τον μετατρέψει σε ακέραια μορφή)
                }

                f2<<"Βρέθηκε το στοιχείο με τιμή "<<number<<" στον πίνακα κατακερματισμού? "<<hashtable.search(number)<<endl; //Εγγράφουμε στο αρχείο output.txt αν βρέθηκε το στοιχείο με τιμή την τιμή που δίνεται στο αρχείο commands.txt
                
                end=clock();
                duration=((double)end-start)/CLOCKS_PER_SEC;
                f2<<"Χρόνος εκτέλεσης της SEARCH HASHTABLE "<<number<<": "<<duration<<endl;
                
            }
            
            
        }
        f2.close(); //Κλείνουμε το αρχείο output.txt
        f.close(); //Κλείνουμε το αρχείο commands.txt
    }
    else
    {
        cerr << "Couldn't open file."; //Αν κάποιο αρχείο δεν μπορεί να ανοίξει επιτυχώς εμφανίζουμε ένα μήνυμα σφάλαμτος στην οθόνη
    }
}
