#include "maxheap.h"
#include <iostream>
#include <fstream>
using namespace std;


//Υλοποιώ μια getter για την τιμή του πίνακα value που βρίσκεται στη θέση i
int maxheap::getvalue(int i)
{
    return value[i];
}

//Υλοποιούμε τον default constructor της maxheap
maxheap::maxheap ()
{
    value = NULL;
    size = 0;
}

//Υλοποιούμε μία συνάρτηση με παράμετρο το όνομα του αρχείου από το οποίο δέχεται τα δεδομένα που εισάγει στο σωρό
void maxheap::build(const char *filename)
{
    ifstream g;
    string timh;
    
    g.open(filename);//Ανοίγουμε το αρχείο filename από το οποίο θα διαβάσουμε τα δεδομένα
    if(g.is_open()) //Ελέγχουμε αν το αρχείο άνοιξε επιτυχώς
    {
        size=0;
        
        while(getline(g,timh)) //Όσο το αρχείο έχει γραμμές που δεν έχουν διαβαστεί αποθήκευσε την επόμενη γραμμή του στον string timh
        {
            insert(stoi(timh)); //Εισάγουμε το στοιχείο με την τιμή που διαβάζουμε κάθε φορά από το αρχείο στον σωρό μεγίστων
        }
        g.close(); //Κλείνουμε το αρχείο
    }
    else
    {
        cerr<<"Couldn't open file."; //Αν το αρχείο δεν μπορεί να ανοίξει επιτυχώς εμφανίζουμε ένα μήνυμα σφάλαμτος στην οθόνη
    }
}

int maxheap::getsize() //Δημιουργούμε μία συνάρτηση getsize η οποία επιστρέφει το size γιατί το size είναι private μεταβλητή
{
    return size;
}

int maxheap::findmax() //Δημιουργούμε μία συνάρτηση findmaxη οποία επιστρέφει το περιεχόμενο της θέσης 0 του πίνακα value γιατί αυτή είναι η τιμή του μέγιστου στοιχείου του σωρού 
{
    return value[0];
}

void maxheap::insert(int number) //Δημιουργούμε μία συνάρτηση insert η οποία εισάγει ένα στοιχείο στην κατάλληλη θέση του στον σωρό μεγίστων. Το στοιχείο αυτό έχει τιμή που δίνεται ως παράμετρος στην συνάρτηση
{
    int h;
    int temp;
    int pinakas[size+1]; //Δημιουργούμε έναν πίνακα ακεραίων ο οποίος έχει μέγεθος ίσο με το μέγεθος του value αυξημένο κατά 1 
    
    
    for(h=0;h<size;h++)
    {
        pinakas[h]=value[h]; //Στον νέο πίνακα αντιγράφουμε όλα τα στοιχεία του value 
    }
    pinakas[h]=number; //Στον νέο πίνακα προσθέτουμε το στοιχείο που θέλουμε να προσθέσουμε στον σωρό 

    delete[] value; //Aποδεσμεύουμε τον χώρο που δεσεμεύσαμε για τον πίνακα value
    
    size++; //Αυξάνουμε το μέγεθος του πίνακα
    value=new int[size]; //Δεσμεύουμε τόσες θέσεις για τον πίνακα value όσες είναι το νέο μέγεθός του
    int x;
    for(x=0;x<size;x++)
    {
        value[x]=pinakas[x]; //Αποθηκεύουμε τις τιμές του πίνακα pinakas στον πίνακα value
    }
    
    
    int thesh_neou_stoixeiou; //Στην μεταβλητή thesh_neou_stoixeiou αποθηκεύουμε τη θέση του νέου στοιχείου στον πίνακα που περιέχει τα στοιχεία του σωρού
    int thesh_gonea; //Στην μεταβλητή thesh_gonea αποθηκεύουμε την θέση του γονέα του νέου στοιχείου
    
    thesh_neou_stoixeiou=x-1; //Το νέο στοιχείο έχει προστεθεί στην τελευταία θέση του πίνακα value 
    thesh_gonea=(thesh_neou_stoixeiou-1)/2; //Σύμφωνα με τύπο που μας έχει δοθεί από την θεωρία αυτή είναι η θέση του γονέα του νέου στοιχείου στον σωρό
    
    while(value[thesh_neou_stoixeiou]>value[thesh_gonea])//Όσο το νέο στοιχείο έχει μεγαλύτερη θέση από τον γονέα του
    {
        //Αντιμεταθέτουμε τα στοιχεία αυτά
        temp=value[thesh_neou_stoixeiou];
        value[thesh_neou_stoixeiou]=value[thesh_gonea];
        value[thesh_gonea]=temp;
        
        thesh_neou_stoixeiou=thesh_gonea; //Ξαναϋπολογίζουμε την θέση του νέου στοιχείου
        thesh_gonea=(thesh_neou_stoixeiou-1)/2; //Ξαναϋπολογίζουμε την θέση του γονέα του νέου στοιχείου
    }
}

void maxheap::deletemax()//Δημιουργούμε μία συνάρτηση deletemin η οποία διαγράφει το μέγιστο στοιχείο από τον σωρό μεγίστων. Αυτό το πραγματοποιεί με την βοήθεια της συνάρτησης sortdeleted 
{
    
    value[0]=value[size-1]; //Εκχωρώ στο πρώτο στοιχείο του σωρού το τελευταίο, χάνοντας έτσι την τιμή του πρώτου
    size--; //Μειώνω το μέγεθος του σωρού κατά 1
    
    sortdeleted(0); //Καλώ την συνάρτηση sortdeleted η οποία κάνει τις κατάλληλες αντιμεταθέσεις έτσι ώστε ο σωρός μεγίστων να εξακολουθήσει να είναι σωρός μεγίστων
}

void maxheap::sortdeleted(int goneas) //Η sortdeleted δέχεται ως παράμετρο τη θέση ενός γονέα στον πίνακα value και ελέγχει αν το  παιδί με τη μεγαλύτερη τιμή έχει τιμή μεγαλύτερη από την τιμή του γονέα. Αν ναι τότε τις αντιμεταθέτει και επαναλαμβάνει τον έλεγχο για τον νέο γονέα του και τα παιδιά του (αν έχει). Αν όχι τότε επιστρέφει.
{
    int temp;
    //Στη μεταβλητή apaidi αποθηκεύεται η θέση του αριστερού παιδιού και στη μεταβλητή dpaidi αποθηκεύεται η θέση του δεξιού παιδιού
    int apaidi,dpaidi; 
    apaidi=2*goneas+1;
    dpaidi=2*goneas+2;
    
    //Ελέγχουμε αν ο γονέας έχει δεξί παιδί. Αν ναι τότε σίγουρα έχει αριστερό επειδή έχουμε σωρό μεγίστων
    if(dpaidi<size)
    {
        if(value[apaidi]>=value[dpaidi]) //Αν από τα δύο παιδιά αυτό με τη μεγαλύτερη τιμή είναι το αριστερό τότε κάνε το αριστερό παιδί γονέα, κάνε τον γονέα αριστερό παιδί και πάνε να ελέγξεις αν ο γονέας που έγινε αριστερό παιδί έχει τιμή μεγαλύτερη από τα νέα παιδιά του (αν έχει)
        {
            if(value[apaidi]>value[goneas]) //Η παραπάνω διαδικασία αν το αριστερό παιδί έχει μεγαλύτερη τιμή ή τα δύο παιδιά έχουν την ίδια τιμή 
            {
                temp=value[apaidi];
                value[apaidi]=value[goneas];
                value[goneas]=temp;
                sortdeleted(apaidi); //Καλούμε την sortdeleted για την θέση του αριστερού παιδιού που όμως πλέον περιέχει την τιμή του γονέα
            }
            else //Αν το παιδί με την μεγαλύτερη τιμή δεν έχει τιμή μεγαλύτερη από την τιμή του γονέα, δηλαδή αν η τιμή του γονέα είναι μεγαλύτερη από τις τιμές και των δύο παιδιών του, τότε το δένδρο είναι σωρός μεγίστων οπότε δεν χρειάζονται άλλες αντιμεταθέσεις
            {
                return;
            }
        }
        else
        {
            if(value[dpaidi]>value[goneas]) //Η παραπάνω διαδικασία αν το δεξί παιδί έχει μεγαλύτερη τιμή 
            {
                temp=value[dpaidi];
                value[dpaidi]=value[goneas];
                value[goneas]=temp;
                sortdeleted(dpaidi); //Καλούμε την sortdeleted για την θέση του δεξιού παιδιού που όμως πλέον περιέχει την τιμή του γονέα
            }
            else
            {
                return;
            }
        }
    } 
    else //Αλλιώς, δηλαδή αν ο γονέας δεν έχει δεξί παιδί
    {
        if(apaidi<size) //Αν ο γονέας έχει μόνο αριστερό παίδι
        {
            if(value[apaidi]>value[goneas]) 
            {
                temp=value[apaidi];
                value[apaidi]=value[goneas];
                value[goneas]=temp;
                sortdeleted(apaidi); //Καλούμε την sortdeleted για την θέση του αριστερού παιδιού που όμως πλέον περιέχει την τιμή του κόμβου
            }
            else //Αν το παιδί με την μεγαλύτερη τιμή δεν έχει τιμή μεγαλύτερη από την τιμή του γονέα, δηλαδή αν η τιμή του γονέα είναι μεγαλύτερη από τις τιμές και των δύο παιδιών του, τότε το δένδρο είναι σωρός μεγίστων οπότε δεν χρειάζονται άλλες αντιμεταθέσεις
            {
                return;
            }
        }
        else //Αν ο γονέας δεν έχει κανένα παιδί
        {
            return;
        }
    }
}
