#ifndef MINHEAP_H
#define MINHEAP_H

class minheap
{
private:
    int size; //Το μέγεθος του σωρού
    int *value; //Ο πίνακας με τις τιμές των κόμβων του σωρού
public:
    minheap(); //default κατασκευαστής που αρχικοποιεί το μέγεθος του σωρού με 0 και δίνει στον δείκτη value την τιμή NULL
    void build(const char *filename); //Συνάρτηση με όρισμα το όνομα του αρχείου από το οποίο διαβάζει τις τιμές του σωρού
    int getvalue(int i); //Getter για την τιμή της i θέσης του πίνακα value
    int getsize(); //Η συνάρτηση getsize είναι η getter που επιστρέφει το μέγεθος του σωρού
    int findmin(); //Η συνάρτηση getmin επιστρέφει το ελάχιστο στοιχείο του σωρού
    void insert(int number); //Η συνάρτηση insert έχει ως όρισμα εναν ακέραιο αριθμό και εισάγει τον αριθμό στον σωρό ελαχίστων
    void deletemin(); //Η συνάρτηση deletemin διαγράφει το ελάχιστο στοιχείο από τον σωρό ελαχίστων
    void sortdeleted(int goneas); //Η συνάρτηση sortdeleted χρησιμοποιείται για την αντιμετάθεση στοιχείων του σωρού έτσι ώστε το στοιχείο goneas να βρίσκεται στη κατάλληλη θέση και το αντικείμενο να παραμείνει σωρός ελαχίστων

};

#endif